{
  "Alduin": { "branch": "master" },
  "Apprentice": { "branch": "master" },
  "Comment.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "Sierra": { "branch": "master" },
  "alpha-nvim": { "branch": "main" },
  "anderson.vim": { "branch": "master" },
  "anthraxylon": { "branch": "main" },
  "aquarium-vim": { "branch": "develop" },
  "arctic.nvim": { "branch": "main" },
  "aurora": { "branch": "master" },
  "aylin.vim": { "branch": "master" },
  "ayu-vim": { "branch": "master" },
  "blue-moon": { "branch": "master" },
  "bluloco.nvim": { "branch": "main" },
  "boo-colorscheme-nvim": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
  "catppuccin": { "branch": "main" },
  "challenger_deep": { "branch": "master" },
  "citruszest.nvim": { "branch": "main" },
  "cmp-copilot": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-tabnine": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "codeium.vim": { "branch": "main" },
  "colorbuddy.nvim": { "branch": "dev" },
  "copilot-cmp": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "deepwhite.nvim": { "branch": "main" },
  "deferred-clipboard.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "dracula": { "branch": "master" },
  "embark": { "branch": "main" },
  "eva01.vim": { "branch": "main" },
  "everblush": { "branch": "main" },
  "falcon": { "branch": "master" },
  "feline.nvim": { "branch": "master" },
  "fidget.nvim": { "branch": "main" },
  "flash.nvim": { "branch": "main" },
  "flattened": { "branch": "master" },
  "flit.nvim": { "branch": "main" },
  "fogbell.vim": { "branch": "master" },
  "friendly-snippets": { "branch": "main" },
  "fzf": { "branch": "master" },
  "fzf-lua": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "gloombuddy": { "branch": "main" },
  "happy_hacking.vim": { "branch": "main" },
  "harpoon": { "branch": "master" },
  "human.vim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "jellybeans-nvim": { "branch": "main" },
  "kanagawa.nvim": { "branch": "master" },
  "kat.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "leap.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "lush.nvim": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "material.vim": { "branch": "main" },
  "melange": { "branch": "master" },
  "mellifluous.nvim": { "branch": "main" },
  "minimalist": { "branch": "master" },
  "modus-theme-vim": { "branch": "master" },
  "monokai-nightasty.nvim": { "branch": "main" },
  "neoconf.nvim": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "neogit": { "branch": "master" },
  "neon": { "branch": "main" },
  "night-owl.vim": { "branch": "master" },
  "nightfox.nvim": { "branch": "main" },
  "nordic.nvim": { "branch": "main" },
  "null-ls.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-deus": { "branch": "master" },
  "nvim-hybrid": { "branch": "main" },
  "nvim-juliana": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-noirbuddy": { "branch": "master" },
  "nvim-spectre": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "nvimgelion": { "branch": "main" },
  "oceanic-material": { "branch": "master" },
  "oceanic-next": { "branch": "master" },
  "ofirkai.nvim": { "branch": "master" },
  "oh-lucy.nvim": { "branch": "main" },
  "onedark.nvim": { "branch": "master" },
  "oxocarbon.nvim": { "branch": "main" },
  "palenight.vim": { "branch": "master" },
  "palenightfall.nvim": { "branch": "main" },
  "pinkmare": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "purify": { "branch": "master" },
  "rasmus.nvim": { "branch": "main" },
  "redalert.nvim": { "branch": "main" },
  "rose-pine": { "branch": "main" },
  "rust-tools.nvim": { "branch": "master" },
  "rust.vim": { "branch": "master" },
  "sacredforest-vim": { "branch": "master" },
  "sentiment.nvim": { "branch": "main" },
  "seoul256.vim": { "branch": "master" },
  "solarized-osaka.nvim": { "branch": "main" },
  "space-vim-theme": { "branch": "master" },
  "tabnine-nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-symbols.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "0.1.x" },
  "tender.vim": { "branch": "master" },
  "termschool-vim-theme": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "tokyonight.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "tune.nvim": { "branch": "main" },
  "vim-afterglow": { "branch": "master" },
  "vim-be-good": { "branch": "master" },
  "vim-colors-lucid": { "branch": "master" },
  "vim-colors-off": { "branch": "main" },
  "vim-colors-paramount": { "branch": "master" },
  "vim-colors-pencil": { "branch": "master" },
  "vim-colors-plain": { "branch": "master" },
  "vim-colors-solarized": { "branch": "master" },
  "vim-deep-space": { "branch": "master" },
  "vim-dichromatic": { "branch": "master" },
  "vim-dogrun": { "branch": "main" },
  "vim-enfocado": { "branch": "main" },
  "vim-envy": { "branch": "master" },
  "vim-fish": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gotham": { "branch": "main" },
  "vim-hybrid-material": { "branch": "master" },
  "vim-latex": { "branch": "master" },
  "vim-leuven-theme": { "branch": "master" },
  "vim-lexical": { "branch": "master" },
  "vim-litecorrect": { "branch": "master" },
  "vim-lucius": { "branch": "master" },
  "vim-monochrome": { "branch": "main" },
  "vim-monokai-tasty": { "branch": "master" },
  "vim-moonfly-colors": { "branch": "cterm-compat" },
  "vim-nightfly-colors": { "branch": "master" },
  "vim-one": { "branch": "master" },
  "vim-orbital": { "branch": "master" },
  "vim-pencil": { "branch": "master" },
  "vim-pink-moon": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sensible": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
  "vim-solarized8": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-textobj-quote": { "branch": "master" },
  "vim-textobj-sentence": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" },
  "vim-thematic": { "branch": "master" },
  "vim-theme-papaya": { "branch": "master" },
  "vim-vinegar": { "branch": "master" },
  "vim-wordy": { "branch": "master" },
  "vimtex": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "zen-mode.nvim": { "branch": "main" },
  "zenburn.nvim": { "branch": "master" },
  "zephyr-nvim": { "branch": "main" }
}